Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/freqm.h
/*
 * Component description for FREQM
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-05-18T19:15:00Z */
#ifndef _PIC32CZCA91_FREQM_COMPONENT_H_
#define _PIC32CZCA91_FREQM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR FREQM                                        */
/* ************************************************************************** */

/* -------- FREQM_CTRLA : (FREQM Offset: 0x00) (R/W 8) Control A Register -------- */
#define FREQM_CTRLA_RESETVALUE                _UINT8_(0x80)                                        /*  (FREQM_CTRLA) Control A Register  Reset Value */

#define FREQM_CTRLA_SWRST_Pos                 _UINT8_(0)                                           /* (FREQM_CTRLA) Software Reset Position */
#define FREQM_CTRLA_SWRST_Msk                 (_UINT8_(0x1) << FREQM_CTRLA_SWRST_Pos)              /* (FREQM_CTRLA) Software Reset Mask */
#define FREQM_CTRLA_SWRST(value)              (FREQM_CTRLA_SWRST_Msk & (_UINT8_(value) << FREQM_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the FREQM_CTRLA register */
#define FREQM_CTRLA_ENABLE_Pos                _UINT8_(1)                                           /* (FREQM_CTRLA) Enable Position */
#define FREQM_CTRLA_ENABLE_Msk                (_UINT8_(0x1) << FREQM_CTRLA_ENABLE_Pos)             /* (FREQM_CTRLA) Enable Mask */
#define FREQM_CTRLA_ENABLE(value)             (FREQM_CTRLA_ENABLE_Msk & (_UINT8_(value) << FREQM_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the FREQM_CTRLA register */
#define FREQM_CTRLA_FREERUN_Pos               _UINT8_(2)                                           /* (FREQM_CTRLA) Free Running Mode Position */
#define FREQM_CTRLA_FREERUN_Msk               (_UINT8_(0x1) << FREQM_CTRLA_FREERUN_Pos)            /* (FREQM_CTRLA) Free Running Mode Mask */
#define FREQM_CTRLA_FREERUN(value)            (FREQM_CTRLA_FREERUN_Msk & (_UINT8_(value) << FREQM_CTRLA_FREERUN_Pos)) /* Assigment of value for FREERUN in the FREQM_CTRLA register */
#define FREQM_CTRLA_RUNSTDBY_Pos              _UINT8_(6)                                           /* (FREQM_CTRLA) Run In Standby Position */
#define FREQM_CTRLA_RUNSTDBY_Msk              (_UINT8_(0x1) << FREQM_CTRLA_RUNSTDBY_Pos)           /* (FREQM_CTRLA) Run In Standby Mask */
#define FREQM_CTRLA_RUNSTDBY(value)           (FREQM_CTRLA_RUNSTDBY_Msk & (_UINT8_(value) << FREQM_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the FREQM_CTRLA register */
#define FREQM_CTRLA_ONDEMAND_Pos              _UINT8_(7)                                           /* (FREQM_CTRLA) On Demand Control Position */
#define FREQM_CTRLA_ONDEMAND_Msk              (_UINT8_(0x1) << FREQM_CTRLA_ONDEMAND_Pos)           /* (FREQM_CTRLA) On Demand Control Mask */
#define FREQM_CTRLA_ONDEMAND(value)           (FREQM_CTRLA_ONDEMAND_Msk & (_UINT8_(value) << FREQM_CTRLA_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the FREQM_CTRLA register */
#define FREQM_CTRLA_Msk                       _UINT8_(0xC7)                                        /* (FREQM_CTRLA) Register Mask  */


/* -------- FREQM_CTRLB : (FREQM Offset: 0x01) ( /W 8) Control B Register -------- */
#define FREQM_CTRLB_RESETVALUE                _UINT8_(0x00)                                        /*  (FREQM_CTRLB) Control B Register  Reset Value */

#define FREQM_CTRLB_START_Pos                 _UINT8_(0)                                           /* (FREQM_CTRLB) Start Measurement Position */
#define FREQM_CTRLB_START_Msk                 (_UINT8_(0x1) << FREQM_CTRLB_START_Pos)              /* (FREQM_CTRLB) Start Measurement Mask */
#define FREQM_CTRLB_START(value)              (FREQM_CTRLB_START_Msk & (_UINT8_(value) << FREQM_CTRLB_START_Pos)) /* Assigment of value for START in the FREQM_CTRLB register */
#define FREQM_CTRLB_Msk                       _UINT8_(0x01)                                        /* (FREQM_CTRLB) Register Mask  */


/* -------- FREQM_CFGA : (FREQM Offset: 0x02) (R/W 16) Config A Register -------- */
#define FREQM_CFGA_RESETVALUE                 _UINT16_(0x00)                                       /*  (FREQM_CFGA) Config A Register  Reset Value */

#define FREQM_CFGA_REFNUM_Pos                 _UINT16_(0)                                          /* (FREQM_CFGA) Number of Reference Clock Cycles Position */
#define FREQM_CFGA_REFNUM_Msk                 (_UINT16_(0xFF) << FREQM_CFGA_REFNUM_Pos)            /* (FREQM_CFGA) Number of Reference Clock Cycles Mask */
#define FREQM_CFGA_REFNUM(value)              (FREQM_CFGA_REFNUM_Msk & (_UINT16_(value) << FREQM_CFGA_REFNUM_Pos)) /* Assigment of value for REFNUM in the FREQM_CFGA register */
#define FREQM_CFGA_MSRSEL_Pos                 _UINT16_(8)                                          /* (FREQM_CFGA) Measurement Clock Selection Position */
#define FREQM_CFGA_MSRSEL_Msk                 (_UINT16_(0x7) << FREQM_CFGA_MSRSEL_Pos)             /* (FREQM_CFGA) Measurement Clock Selection Mask */
#define FREQM_CFGA_MSRSEL(value)              (FREQM_CFGA_MSRSEL_Msk & (_UINT16_(value) << FREQM_CFGA_MSRSEL_Pos)) /* Assigment of value for MSRSEL in the FREQM_CFGA register */
#define   FREQM_CFGA_MSRSEL_GCLK_Val          _UINT16_(0x0)                                        /* (FREQM_CFGA) GCLK Input Clock  */
#define   FREQM_CFGA_MSRSEL_CPU_Val           _UINT16_(0x1)                                        /* (FREQM_CFGA) CPU Input Clock  */
#define FREQM_CFGA_MSRSEL_GCLK                (FREQM_CFGA_MSRSEL_GCLK_Val << FREQM_CFGA_MSRSEL_Pos) /* (FREQM_CFGA) GCLK Input Clock Position  */
#define FREQM_CFGA_MSRSEL_CPU                 (FREQM_CFGA_MSRSEL_CPU_Val << FREQM_CFGA_MSRSEL_Pos) /* (FREQM_CFGA) CPU Input Clock Position  */
#define FREQM_CFGA_DIVREF_Pos                 _UINT16_(15)                                         /* (FREQM_CFGA) Divide Reference Clock Position */
#define FREQM_CFGA_DIVREF_Msk                 (_UINT16_(0x1) << FREQM_CFGA_DIVREF_Pos)             /* (FREQM_CFGA) Divide Reference Clock Mask */
#define FREQM_CFGA_DIVREF(value)              (FREQM_CFGA_DIVREF_Msk & (_UINT16_(value) << FREQM_CFGA_DIVREF_Pos)) /* Assigment of value for DIVREF in the FREQM_CFGA register */
#define   FREQM_CFGA_DIVREF_DIV1_Val          _UINT16_(0x0)                                        /* (FREQM_CFGA) The reference clock is divided by 1  */
#define   FREQM_CFGA_DIVREF_DIV8_Val          _UINT16_(0x1)                                        /* (FREQM_CFGA) The reference clock is divided by 8  */
#define FREQM_CFGA_DIVREF_DIV1                (FREQM_CFGA_DIVREF_DIV1_Val << FREQM_CFGA_DIVREF_Pos) /* (FREQM_CFGA) The reference clock is divided by 1 Position  */
#define FREQM_CFGA_DIVREF_DIV8                (FREQM_CFGA_DIVREF_DIV8_Val << FREQM_CFGA_DIVREF_Pos) /* (FREQM_CFGA) The reference clock is divided by 8 Position  */
#define FREQM_CFGA_Msk                        _UINT16_(0x87FF)                                     /* (FREQM_CFGA) Register Mask  */


/* -------- FREQM_CTRLC : (FREQM Offset: 0x04) (R/W 8) Control C Register -------- */
#define FREQM_CTRLC_RESETVALUE                _UINT8_(0x00)                                        /*  (FREQM_CTRLC) Control C Register  Reset Value */

#define FREQM_CTRLC_WINMODE_Pos               _UINT8_(0)                                           /* (FREQM_CTRLC) Window Monitor Mode Position */
#define FREQM_CTRLC_WINMODE_Msk               (_UINT8_(0x7) << FREQM_CTRLC_WINMODE_Pos)            /* (FREQM_CTRLC) Window Monitor Mode Mask */
#define FREQM_CTRLC_WINMODE(value)            (FREQM_CTRLC_WINMODE_Msk & (_UINT8_(value) << FREQM_CTRLC_WINMODE_Pos)) /* Assigment of value for WINMODE in the FREQM_CTRLC register */
#define   FREQM_CTRLC_WINMODE_DISABLE_Val     _UINT8_(0x0)                                         /* (FREQM_CTRLC) No window mode (default)  */
#define   FREQM_CTRLC_WINMODE_MODE1_Val       _UINT8_(0x1)                                         /* (FREQM_CTRLC) VALUE > WINLT  */
#define   FREQM_CTRLC_WINMODE_MODE2_Val       _UINT8_(0x2)                                         /* (FREQM_CTRLC) VALUE < WINUT  */
#define   FREQM_CTRLC_WINMODE_MODE3_Val       _UINT8_(0x3)                                         /* (FREQM_CTRLC) WINLT < VALUE < WINUT  */
#define   FREQM_CTRLC_WINMODE_MODE4_Val       _UINT8_(0x4)                                         /* (FREQM_CTRLC) !(WINLT < VALUE < WINUT)  */
#define FREQM_CTRLC_WINMODE_DISABLE           (FREQM_CTRLC_WINMODE_DISABLE_Val << FREQM_CTRLC_WINMODE_Pos) /* (FREQM_CTRLC) No window mode (default) Position  */
#define FREQM_CTRLC_WINMODE_MODE1             (FREQM_CTRLC_WINMODE_MODE1_Val << FREQM_CTRLC_WINMODE_Pos) /* (FREQM_CTRLC) VALUE > WINLT Position  */
#define FREQM_CTRLC_WINMODE_MODE2             (FREQM_CTRLC_WINMODE_MODE2_Val << FREQM_CTRLC_WINMODE_Pos) /* (FREQM_CTRLC) VALUE < WINUT Position  */
#define FREQM_CTRLC_WINMODE_MODE3             (FREQM_CTRLC_WINMODE_MODE3_Val << FREQM_CTRLC_WINMODE_Pos) /* (FREQM_CTRLC) WINLT < VALUE < WINUT Position  */
#define FREQM_CTRLC_WINMODE_MODE4             (FREQM_CTRLC_WINMODE_MODE4_Val << FREQM_CTRLC_WINMODE_Pos) /* (FREQM_CTRLC) !(WINLT < VALUE < WINUT) Position  */
#define FREQM_CTRLC_Msk                       _UINT8_(0x07)                                        /* (FREQM_CTRLC) Register Mask  */


/* -------- FREQM_EVCTRL : (FREQM Offset: 0x06) (R/W 8) Event Control Register -------- */
#define FREQM_EVCTRL_RESETVALUE               _UINT8_(0x00)                                        /*  (FREQM_EVCTRL) Event Control Register  Reset Value */

#define FREQM_EVCTRL_STARTEI_Pos              _UINT8_(0)                                           /* (FREQM_EVCTRL) Start Measurement Event Input Enable Position */
#define FREQM_EVCTRL_STARTEI_Msk              (_UINT8_(0x1) << FREQM_EVCTRL_STARTEI_Pos)           /* (FREQM_EVCTRL) Start Measurement Event Input Enable Mask */
#define FREQM_EVCTRL_STARTEI(value)           (FREQM_EVCTRL_STARTEI_Msk & (_UINT8_(value) << FREQM_EVCTRL_STARTEI_Pos)) /* Assigment of value for STARTEI in the FREQM_EVCTRL register */
#define FREQM_EVCTRL_STARTINV_Pos             _UINT8_(1)                                           /* (FREQM_EVCTRL) Start Measurement Event Invert Enable Position */
#define FREQM_EVCTRL_STARTINV_Msk             (_UINT8_(0x1) << FREQM_EVCTRL_STARTINV_Pos)          /* (FREQM_EVCTRL) Start Measurement Event Invert Enable Mask */
#define FREQM_EVCTRL_STARTINV(value)          (FREQM_EVCTRL_STARTINV_Msk & (_UINT8_(value) << FREQM_EVCTRL_STARTINV_Pos)) /* Assigment of value for STARTINV in the FREQM_EVCTRL register */
#define FREQM_EVCTRL_DONEEO_Pos               _UINT8_(4)                                           /* (FREQM_EVCTRL) Measurement Done Event Out Position */
#define FREQM_EVCTRL_DONEEO_Msk               (_UINT8_(0x1) << FREQM_EVCTRL_DONEEO_Pos)            /* (FREQM_EVCTRL) Measurement Done Event Out Mask */
#define FREQM_EVCTRL_DONEEO(value)            (FREQM_EVCTRL_DONEEO_Msk & (_UINT8_(value) << FREQM_EVCTRL_DONEEO_Pos)) /* Assigment of value for DONEEO in the FREQM_EVCTRL register */
#define FREQM_EVCTRL_WINMONEO_Pos             _UINT8_(5)                                           /* (FREQM_EVCTRL) Window Monitor Event Out Position */
#define FREQM_EVCTRL_WINMONEO_Msk             (_UINT8_(0x1) << FREQM_EVCTRL_WINMONEO_Pos)          /* (FREQM_EVCTRL) Window Monitor Event Out Mask */
#define FREQM_EVCTRL_WINMONEO(value)          (FREQM_EVCTRL_WINMONEO_Msk & (_UINT8_(value) << FREQM_EVCTRL_WINMONEO_Pos)) /* Assigment of value for WINMONEO in the FREQM_EVCTRL register */
#define FREQM_EVCTRL_Msk                      _UINT8_(0x33)                                        /* (FREQM_EVCTRL) Register Mask  */


/* -------- FREQM_INTENCLR : (FREQM Offset: 0x08) (R/W 8) Interrupt Enable Clear Register -------- */
#define FREQM_INTENCLR_RESETVALUE             _UINT8_(0x00)                                        /*  (FREQM_INTENCLR) Interrupt Enable Clear Register  Reset Value */

