Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/freqm.h
#define FREQM_INTENCLR_DONE_Pos               _UINT8_(0)                                           /* (FREQM_INTENCLR) Measurement Done Interrupt Disable Position */
#define FREQM_INTENCLR_DONE_Msk               (_UINT8_(0x1) << FREQM_INTENCLR_DONE_Pos)            /* (FREQM_INTENCLR) Measurement Done Interrupt Disable Mask */
#define FREQM_INTENCLR_DONE(value)            (FREQM_INTENCLR_DONE_Msk & (_UINT8_(value) << FREQM_INTENCLR_DONE_Pos)) /* Assigment of value for DONE in the FREQM_INTENCLR register */
#define FREQM_INTENCLR_WINMON_Pos             _UINT8_(1)                                           /* (FREQM_INTENCLR) Window Monitor Interrupt Disable Position */
#define FREQM_INTENCLR_WINMON_Msk             (_UINT8_(0x1) << FREQM_INTENCLR_WINMON_Pos)          /* (FREQM_INTENCLR) Window Monitor Interrupt Disable Mask */
#define FREQM_INTENCLR_WINMON(value)          (FREQM_INTENCLR_WINMON_Msk & (_UINT8_(value) << FREQM_INTENCLR_WINMON_Pos)) /* Assigment of value for WINMON in the FREQM_INTENCLR register */
#define FREQM_INTENCLR_Msk                    _UINT8_(0x03)                                        /* (FREQM_INTENCLR) Register Mask  */


/* -------- FREQM_INTENSET : (FREQM Offset: 0x09) (R/W 8) Interrupt Enable Set Register -------- */
#define FREQM_INTENSET_RESETVALUE             _UINT8_(0x00)                                        /*  (FREQM_INTENSET) Interrupt Enable Set Register  Reset Value */

#define FREQM_INTENSET_DONE_Pos               _UINT8_(0)                                           /* (FREQM_INTENSET) Measurement Done Interrupt Enable Position */
#define FREQM_INTENSET_DONE_Msk               (_UINT8_(0x1) << FREQM_INTENSET_DONE_Pos)            /* (FREQM_INTENSET) Measurement Done Interrupt Enable Mask */
#define FREQM_INTENSET_DONE(value)            (FREQM_INTENSET_DONE_Msk & (_UINT8_(value) << FREQM_INTENSET_DONE_Pos)) /* Assigment of value for DONE in the FREQM_INTENSET register */
#define FREQM_INTENSET_WINMON_Pos             _UINT8_(1)                                           /* (FREQM_INTENSET) Window Monitor Interrupt Enable Position */
#define FREQM_INTENSET_WINMON_Msk             (_UINT8_(0x1) << FREQM_INTENSET_WINMON_Pos)          /* (FREQM_INTENSET) Window Monitor Interrupt Enable Mask */
#define FREQM_INTENSET_WINMON(value)          (FREQM_INTENSET_WINMON_Msk & (_UINT8_(value) << FREQM_INTENSET_WINMON_Pos)) /* Assigment of value for WINMON in the FREQM_INTENSET register */
#define FREQM_INTENSET_Msk                    _UINT8_(0x03)                                        /* (FREQM_INTENSET) Register Mask  */


/* -------- FREQM_INTFLAG : (FREQM Offset: 0x0A) (R/W 8) Interrupt Flag Register -------- */
#define FREQM_INTFLAG_RESETVALUE              _UINT8_(0x00)                                        /*  (FREQM_INTFLAG) Interrupt Flag Register  Reset Value */

#define FREQM_INTFLAG_DONE_Pos                _UINT8_(0)                                           /* (FREQM_INTFLAG) Measurement Done Position */
#define FREQM_INTFLAG_DONE_Msk                (_UINT8_(0x1) << FREQM_INTFLAG_DONE_Pos)             /* (FREQM_INTFLAG) Measurement Done Mask */
#define FREQM_INTFLAG_DONE(value)             (FREQM_INTFLAG_DONE_Msk & (_UINT8_(value) << FREQM_INTFLAG_DONE_Pos)) /* Assigment of value for DONE in the FREQM_INTFLAG register */
#define FREQM_INTFLAG_WINMON_Pos              _UINT8_(1)                                           /* (FREQM_INTFLAG) Window Monitor Position */
#define FREQM_INTFLAG_WINMON_Msk              (_UINT8_(0x1) << FREQM_INTFLAG_WINMON_Pos)           /* (FREQM_INTFLAG) Window Monitor Mask */
#define FREQM_INTFLAG_WINMON(value)           (FREQM_INTFLAG_WINMON_Msk & (_UINT8_(value) << FREQM_INTFLAG_WINMON_Pos)) /* Assigment of value for WINMON in the FREQM_INTFLAG register */
#define FREQM_INTFLAG_Msk                     _UINT8_(0x03)                                        /* (FREQM_INTFLAG) Register Mask  */


/* -------- FREQM_STATUS : (FREQM Offset: 0x0B) (R/W 8) Status Register -------- */
#define FREQM_STATUS_RESETVALUE               _UINT8_(0x00)                                        /*  (FREQM_STATUS) Status Register  Reset Value */

#define FREQM_STATUS_BUSY_Pos                 _UINT8_(0)                                           /* (FREQM_STATUS) FREQM Status Position */
#define FREQM_STATUS_BUSY_Msk                 (_UINT8_(0x1) << FREQM_STATUS_BUSY_Pos)              /* (FREQM_STATUS) FREQM Status Mask */
#define FREQM_STATUS_BUSY(value)              (FREQM_STATUS_BUSY_Msk & (_UINT8_(value) << FREQM_STATUS_BUSY_Pos)) /* Assigment of value for BUSY in the FREQM_STATUS register */
#define FREQM_STATUS_OVF_Pos                  _UINT8_(1)                                           /* (FREQM_STATUS) Sticky Count Value Overflow Position */
#define FREQM_STATUS_OVF_Msk                  (_UINT8_(0x1) << FREQM_STATUS_OVF_Pos)               /* (FREQM_STATUS) Sticky Count Value Overflow Mask */
#define FREQM_STATUS_OVF(value)               (FREQM_STATUS_OVF_Msk & (_UINT8_(value) << FREQM_STATUS_OVF_Pos)) /* Assigment of value for OVF in the FREQM_STATUS register */
#define FREQM_STATUS_Msk                      _UINT8_(0x03)                                        /* (FREQM_STATUS) Register Mask  */


/* -------- FREQM_SYNCBUSY : (FREQM Offset: 0x0C) ( R/ 32) Synchronization Busy Register -------- */
#define FREQM_SYNCBUSY_RESETVALUE             _UINT32_(0x00)                                       /*  (FREQM_SYNCBUSY) Synchronization Busy Register  Reset Value */

#define FREQM_SYNCBUSY_SWRST_Pos              _UINT32_(0)                                          /* (FREQM_SYNCBUSY) Software Reset Position */
#define FREQM_SYNCBUSY_SWRST_Msk              (_UINT32_(0x1) << FREQM_SYNCBUSY_SWRST_Pos)          /* (FREQM_SYNCBUSY) Software Reset Mask */
#define FREQM_SYNCBUSY_SWRST(value)           (FREQM_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << FREQM_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the FREQM_SYNCBUSY register */
#define FREQM_SYNCBUSY_ENABLE_Pos             _UINT32_(1)                                          /* (FREQM_SYNCBUSY) Enable Position */
#define FREQM_SYNCBUSY_ENABLE_Msk             (_UINT32_(0x1) << FREQM_SYNCBUSY_ENABLE_Pos)         /* (FREQM_SYNCBUSY) Enable Mask */
#define FREQM_SYNCBUSY_ENABLE(value)          (FREQM_SYNCBUSY_ENABLE_Msk & (_UINT32_(value) << FREQM_SYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the FREQM_SYNCBUSY register */
#define FREQM_SYNCBUSY_Msk                    _UINT32_(0x00000003)                                 /* (FREQM_SYNCBUSY) Register Mask  */


/* -------- FREQM_VALUE : (FREQM Offset: 0x10) ( R/ 32) Count Value Register -------- */
#define FREQM_VALUE_RESETVALUE                _UINT32_(0x00)                                       /*  (FREQM_VALUE) Count Value Register  Reset Value */

#define FREQM_VALUE_VALUE_Pos                 _UINT32_(0)                                          /* (FREQM_VALUE) Measurement Value Position */
#define FREQM_VALUE_VALUE_Msk                 (_UINT32_(0xFFFFFF) << FREQM_VALUE_VALUE_Pos)        /* (FREQM_VALUE) Measurement Value Mask */
#define FREQM_VALUE_VALUE(value)              (FREQM_VALUE_VALUE_Msk & (_UINT32_(value) << FREQM_VALUE_VALUE_Pos)) /* Assigment of value for VALUE in the FREQM_VALUE register */
#define FREQM_VALUE_Msk                       _UINT32_(0x00FFFFFF)                                 /* (FREQM_VALUE) Register Mask  */


/* -------- FREQM_WINLT : (FREQM Offset: 0x20) (R/W 32) Window Monitor Lower Threshold -------- */
#define FREQM_WINLT_RESETVALUE                _UINT32_(0x00)                                       /*  (FREQM_WINLT) Window Monitor Lower Threshold  Reset Value */

#define FREQM_WINLT_WINLT_Pos                 _UINT32_(0)                                          /* (FREQM_WINLT) Window Lower Threshold Position */
#define FREQM_WINLT_WINLT_Msk                 (_UINT32_(0xFFFFFF) << FREQM_WINLT_WINLT_Pos)        /* (FREQM_WINLT) Window Lower Threshold Mask */
#define FREQM_WINLT_WINLT(value)              (FREQM_WINLT_WINLT_Msk & (_UINT32_(value) << FREQM_WINLT_WINLT_Pos)) /* Assigment of value for WINLT in the FREQM_WINLT register */
#define FREQM_WINLT_Msk                       _UINT32_(0x00FFFFFF)                                 /* (FREQM_WINLT) Register Mask  */


/* -------- FREQM_WINUT : (FREQM Offset: 0x24) (R/W 32) Window Monitor Upper Threshold -------- */
#define FREQM_WINUT_RESETVALUE                _UINT32_(0x00)                                       /*  (FREQM_WINUT) Window Monitor Upper Threshold  Reset Value */

#define FREQM_WINUT_WINUT_Pos                 _UINT32_(0)                                          /* (FREQM_WINUT) Window Upper Threshold Position */
#define FREQM_WINUT_WINUT_Msk                 (_UINT32_(0xFFFFFF) << FREQM_WINUT_WINUT_Pos)        /* (FREQM_WINUT) Window Upper Threshold Mask */
#define FREQM_WINUT_WINUT(value)              (FREQM_WINUT_WINUT_Msk & (_UINT32_(value) << FREQM_WINUT_WINUT_Pos)) /* Assigment of value for WINUT in the FREQM_WINUT register */
#define FREQM_WINUT_Msk                       _UINT32_(0x00FFFFFF)                                 /* (FREQM_WINUT) Register Mask  */


/** \brief FREQM register offsets definitions */
#define FREQM_CTRLA_REG_OFST           _UINT32_(0x00)      /* (FREQM_CTRLA) Control A Register Offset */
#define FREQM_CTRLB_REG_OFST           _UINT32_(0x01)      /* (FREQM_CTRLB) Control B Register Offset */
#define FREQM_CFGA_REG_OFST            _UINT32_(0x02)      /* (FREQM_CFGA) Config A Register Offset */
#define FREQM_CTRLC_REG_OFST           _UINT32_(0x04)      /* (FREQM_CTRLC) Control C Register Offset */
#define FREQM_EVCTRL_REG_OFST          _UINT32_(0x06)      /* (FREQM_EVCTRL) Event Control Register Offset */
#define FREQM_INTENCLR_REG_OFST        _UINT32_(0x08)      /* (FREQM_INTENCLR) Interrupt Enable Clear Register Offset */
#define FREQM_INTENSET_REG_OFST        _UINT32_(0x09)      /* (FREQM_INTENSET) Interrupt Enable Set Register Offset */
#define FREQM_INTFLAG_REG_OFST         _UINT32_(0x0A)      /* (FREQM_INTFLAG) Interrupt Flag Register Offset */
#define FREQM_STATUS_REG_OFST          _UINT32_(0x0B)      /* (FREQM_STATUS) Status Register Offset */
#define FREQM_SYNCBUSY_REG_OFST        _UINT32_(0x0C)      /* (FREQM_SYNCBUSY) Synchronization Busy Register Offset */
#define FREQM_VALUE_REG_OFST           _UINT32_(0x10)      /* (FREQM_VALUE) Count Value Register Offset */
#define FREQM_WINLT_REG_OFST           _UINT32_(0x20)      /* (FREQM_WINLT) Window Monitor Lower Threshold Offset */
#define FREQM_WINUT_REG_OFST           _UINT32_(0x24)      /* (FREQM_WINUT) Window Monitor Upper Threshold Offset */

